{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyO03hr6/iwTc1nkSobcjmfW"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["# Операторы ветвлений. Часть 3\n"],"metadata":{"id":"507Q2H5ftpO2"}},{"cell_type":"markdown","source":["## Задание 1. Счастливое число\n","Пользователь вводит с клавиатуры целое шестизначное число. Написать программу, которая определяет,\n","является ли введенное число — счастливым (Счастливым считается шестизначное число, у которого сумма\n","первых 3 цифр равна сумме вторых трех цифр).\n","\n","Например, число 123321 - счастливое, так как 1+2+3 = 3+2+1.\n","\n","С другой стороны 378423 несчастливое число, так\n","как 3+7+8 != 4+2+3.\n","\n","Если пользователь ввел не шестизначное число требуется вывести сообщение об ошибке."],"metadata":{"id":"DjNPFRQHtuGm"}},{"cell_type":"code","execution_count":null,"metadata":{"id":"XWqCpxnrtlJf"},"outputs":[],"source":[]},{"cell_type":"markdown","source":["## Задание 2. Частичный реверс\n","Пользователь вводит шестизначное число.\n","\n","Необходимо поменять местами в этом числе первую и шестую цифры, а также вторую и пятую цифры.\n","\n","Например, 723895 должно превратиться в 593827.\n","\n","Если пользователь ввел не шестизначное число требуется вывести сообщение об ошибке."],"metadata":{"id":"G4AmYSyouij1"}},{"cell_type":"code","source":[],"metadata":{"id":"QwhTX7dJui0v"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["## Задание 3. Камень-ножницы-бумага\n","\n","Два пользователя по очереди вводят свой вариант хода для игры камень-ножницы бумага.\n","\n","Необходимо определить победителя или ничью.\n","\n","В случае неверного выбора комбинации вывести ошибку."],"metadata":{"id":"BTslmqwku_IR"}},{"cell_type":"code","source":[],"metadata":{"id":"rjFtFWhtu_cG"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["# Циклы. Часть 1"],"metadata":{"id":"NREVAU-VyjNW"}},{"cell_type":"markdown","source":["## Пример работы с циклом for\n","\n","Выведем на экран \"ёлочку\" с помощью символов \"*\""],"metadata":{"id":"jRqWzvXqz6-F"}},{"cell_type":"code","source":["N = 5  # количество итераций (прогонов)\n","for i in range(N):  # range - диапазон для цикла\n","    n = 2 * i + 1\n","    s = (2 * N - n) // 2\n","    print(f\"{' ' * s}{'*' * n}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"r5VGQBqBz7YO","executionInfo":{"status":"ok","timestamp":1712165402926,"user_tz":-180,"elapsed":3,"user":{"displayName":"Костян Коночкин","userId":"15290111825032832687"}},"outputId":"442fcec8-f0bb-46de-d2bd-d9c0376ae126"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["    *\n","   ***\n","  *****\n"," *******\n","*********\n"]}]},{"cell_type":"markdown","source":["## Пример работы с циклом while\n","\n","Выведем на экран цифры заданного числа в обратном порядке"],"metadata":{"id":"i8ccJms3_Can"}},{"cell_type":"code","source":["number = 12379\n","while number > 0:  # проверка условия окончания цикла\n","    print(number % 10)\n","    number = number // 10"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"_wZq93lH_CwG","executionInfo":{"status":"ok","timestamp":1712165424993,"user_tz":-180,"elapsed":663,"user":{"displayName":"Костян Коночкин","userId":"15290111825032832687"}},"outputId":"6d8f48fe-8fc6-4296-f651-303ca220fbf8"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["9\n","7\n","3\n","2\n","1\n"]}]},{"cell_type":"markdown","source":["## Задание 1. Диапазон\n","\n"],"metadata":{"id":"zHkmbq5wypVN"}},{"cell_type":"markdown","source":["Пользователь вводит с клавиатуры два числа. Нужно\n","показать все числа в указанном диапазоне,\n","посчитать сумму и среднеарифметическое."],"metadata":{"id":"nQGfrMZCup96"}},{"cell_type":"code","source":[],"metadata":{"id":"DtAoVQ7yyo9-"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["## Задание 2. Факториал\n"],"metadata":{"id":"x-TE17sLBM-L"}},{"cell_type":"markdown","source":["\n","Пользователь вводит с клавиатуры число. Требуется\n","посчитать факториал числа.\n","\n","Например, если введено 3, факториал числа 1\\*2*3 = 6.\n","\n","Формула для расчета факториала: n! = 1\\*2\\*3…*n, где\n","n — число для расчета факториала."],"metadata":{"id":"u_eC97gwuxh9"}},{"cell_type":"code","source":[],"metadata":{"id":"XRyvXG7vBNP-"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["## Задание 3. Таблица умножения\n","\n"],"metadata":{"id":"Ua3Zs3KtE7-E"}},{"cell_type":"markdown","source":["Показать таблицу умножения для числа, введенного\n","пользователем. Например, если пользователь вводит\n","число 7, нужно показать:\n","\n","7 * 1 = 7\n","\n","7 * 2 = 14\n","\n","7 * 3 = 21\n","\n","…"],"metadata":{"id":"9jyDMYQfu3CQ"}},{"cell_type":"code","source":[],"metadata":{"id":"QF265OugE8O0"},"execution_count":null,"outputs":[]},{"cell_type":"markdown","source":["## Задание 4. Таблица умножения 2D\n"],"metadata":{"id":"Z_g3-qOyCEVw"}},{"cell_type":"markdown","source":["\n","Выведите на экран таблицу умножения, где первая строка и первый столбец - это числа от 2 до 9, а все остальные элементы - это произведения чисел из  соответствующих строки и столбца."],"metadata":{"id":"rUaTjFVGu7Ut"}},{"cell_type":"code","source":[],"metadata":{"id":"GaWrN3XQCEki"},"execution_count":null,"outputs":[]}]}